# NumPy

#### 1. How to extract all odd numbers from arr?

In [1]:
def extract_odd_numbers(arr):
    return [num for num in arr if num % 2 != 0]
arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
odd_numbers = extract_odd_numbers(arr)
print("Odd numbers:", odd_numbers)

Odd numbers: [1, 3, 5, 7, 9]

#### 2. Replace all odd numbers in arr with -1 without changing.

In [2]:
import numpy as np
arr = np.array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
arr[arr % 2 != 0] = -1
print(arr)

[ 0 -1  2 -1  4 -1  6 -1  8 -1 10]

#### 3. Convert a 1D array to a 2D array with 2 rows

In [3]:
import numpy as np
arr=np.arange(10)
new_arr = np.reshape(arr, (-1 , 5))
new_arr

array([[0, 1, 2, 3, 4],
       [5, 6, 7, 8, 9]])

#### 4. Stack arrays a and b vertically

In [4]:
import numpy as np
a = np.arange(10).reshape(2,-1)
b = np.repeat(1, 10).reshape(2,-1)
vertical = np.vstack((a,b))
vertical

array([[0, 1, 2, 3, 4],
       [5, 6, 7, 8, 9],
       [1, 1, 1, 1, 1],
       [1, 1, 1, 1, 1]])

#### 5. Stack the arrays a and b horizontally.

In [5]:
import numpy as np
a = np.arange(10).reshape(2,-1)
b = np.repeat(1, 10).reshape(2,-1)
horizontally = np.hstack((a,b))
horizontally

array([[0, 1, 2, 3, 4, 1, 1, 1, 1, 1],
       [5, 6, 7, 8, 9, 1, 1, 1, 1, 1]])

#### 6.How to get the common items between two python numpy arrays?

In [6]:
import numpy as np
a = np.array([1,2,3,2,3,4,3,4,5,6])
b = np.array([7,2,10,2,7,4,9,4,9,8])
np.intersect1d(a,b)

array([2, 4])

#### 7.How to remove from one array those items that exist in another? From array a remove all items present in array b

In [7]:
import numpy as np

a = np.array([1,2,3,4,5])
b = np.array([5,6,7,8,9])
np.union1d(a,b)

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

#### 8. How to get the positions where elements of two arrays match? Get the positions where elements of a and b match

In [8]:
import numpy as np
a = np.array([1,2,3,8,3,4,3,4,5,6])
b = np.array([7,2,10,2,7,5,9,4,9,8])
np.where(a==b)

(array([1, 7]),)

#### 9. How to extract all numbers between a given range from a numpy array?
Get all items between 5 and 10 from a

In [1]:
import numpy as np

a = np.array([2, 6, 1, 19, 10, 3, 20])
a[np.where(np.logical_and(a >=  5 , a <= 10))]

array([ 6, 10])

# Pandas

## Pandas Data Series

#### 1. Write a Pandas program to convert a dictionary to a Pandas series.

Sample Series:
Original dictionary:
{'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}

Converted series:
a     100
b     200
c     300
d     400
e     800

In [6]:
import pandas as pd
dictionary = {'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
converted_series = pd.Series(dictionary)
print(converted_series)

a    100
b    200
c    300
d    400
e    800
dtype: int64

#### 2. Write a Pandas program to convert a NumPy array to a Pandas series.
Sample Series:
  NumPy array:
[10 20 30 40 50]
Converted Pandas series:
0    10
1    20
2    30
3    40
4    50
dtype: int64

In [7]:
narray =np.array([10, 20, 30, 40, 50])
converted_series = pd.Series(narray)
converted_series

0    10
1    20
2    30
3    40
4    50
dtype: int64

#### 3. Write a Pandas program to change the data type of given a column or a Series.
Sample Series:
    Original Data Series:
0       100
1       200
2    python
3    300.12
4       400
dtype: object
Change the said data type to numeric:
0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64

In [8]:
import pandas as pd
original_series = pd.Series([100, 200, 'python', 300.12, 400])
print("original data series:")
print(original_series)
print("Change the said data type to numeric:")
new_series = pd.to_numeric(original_series, errors = 'coerce')
new_series

original data series:
0       100
1       200
2    python
3    300.12
4       400
dtype: object
Change the said data type to numeric:

0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64

#### 4.  Write a Pandas program to convert the first column of a DataFrame as a Series.
Sample Output:  
Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

1st column as a Series:
0     1
1     2
2     3
3     4
4     7
5    11
Name: col1, dtype: int64
<class 'pandas.core.series.Series'>

In [9]:
import pandas as pd
dic = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1, 11]}
dframe = pd.DataFrame(data=dic)
print("Original series:")
print(dframe)

print("1st column as a series:")
series1 = dframe.iloc[:, 0]
series1

Original series:
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11
1st column as a series:

0     1
1     2
2     3
3     4
4     7
5    11
Name: col1, dtype: int64

#### 5. Write a Pandas program to convert a given Series to an array.
Sample Output:
Original Data Series:
0       100
1       200
2    python
3    300.12
4       400
dtype: object
Series to an array
['100' '200' 'python' '300.12' '400']
<class 'numpy.ndarray'>

In [10]:
import pandas as pd
import numpy as np
dseries = pd.Series(['100', '200', 'python', '300.12', '400'])
print("Original Data Series :")
print(dseries)
print("Series to an array :")
arr =np.array(dseries.values.tolist())
print(arr)
print(type(arr))

Original Data Series :
0       100
1       200
2    python
3    300.12
4       400
dtype: object
Series to an array :
['100' '200' 'python' '300.12' '400']
<class 'numpy.ndarray'>

#### 6. Write a Pandas program to convert Series of lists to one Series.
Sample Output:
Original Series of list
0    [Red, Green, White]
1           [Red, Black]
2               [Yellow]
dtype: object
One Series
0       Red
1     Green
2     White
3       Red
4     Black
5    Yellow
dtype: object

In [11]:
import pandas as p
series = pd.Series([
         ['Red', 'Green', 'White'],
         ['Red', 'Black'],
         ['Yellow']])
print("Original series of list :")
print(series)
series = series.apply(pd.Series).stack().reset_index(drop = True)
print("One series :")
print(series)

Original series of list :
0    [Red, Green, White]
1           [Red, Black]
2               [Yellow]
dtype: object
One series :
0       Red
1     Green
2     White
3       Red
4     Black
5    Yellow
dtype: object

#### 7. Write a Pandas program to sort a given Series.
Sample Output:
Original Data Series:
0       100
1       200
2    python
3    300.12
4       400
dtype: object
0       100
1       200
3    300.12
4       400
2    python
dtype: object

In [12]:
import pandas as pd
series = pd.Series(['100','200','python','300.12','400'])
print("Original  series :")
print(series)
new_series = pd.Series(series).sort_values()
print(new_series)

Original  series :
0       100
1       200
2    python
3    300.12
4       400
dtype: object
0       100
1       200
3    300.12
4       400
2    python
dtype: object

# Pandas DataFrame

#### 1.Write a Pandas program to create a dataframe from a dictionary and display it.

Sample data: {'X':[78,85,96,80,86],  'Y':[84,94,89,83,86], 'Z':[86,97,96,72,83]}

In [14]:
import pandas as pd
data = {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}
dataframe = pd.DataFrame(data)
dataframe

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

#### 2. Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [15]:
import pandas as pd
import numpy as np

exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
dataframe = pd.DataFrame(exam_data, index = labels)
dataframe

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

#### 3. Write a Pandas program to get the first 3 rows of a given DataFrame.
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [16]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
dataframes =  pd.DataFrame(exam_data , index = labels)
print("First three rows of the data frame :")
dataframe.iloc[:3]

First three rows of the data frame :

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

#### 4.Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame.
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [17]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
dataframe = pd.DataFrame(exam_data , index = labels)
print("Select specific columns :")
dataframe[['name', 'score']]

Select specific columns :

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

#### 5. Write a Pandas program to select the specified columns and rows from a given data frame.
Sample Python dictionary data and list labels:
Select 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame.
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [18]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
dataframe = pd.DataFrame(exam_data , index = labels)
print("Select specific columns and rows :")
dataframe.iloc[[1,3,5,6],[1,3]]

Select specific columns and rows :

   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
g   14.5     yes

#### 6. Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2.
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [20]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
dataframe = pd.DataFrame(exam_data, index = labels)
print("Number of attempts in the examination greater than 2:")
dataframe[dataframe['attempts'] > 2]

Number of attempts in the examination greater than 2:

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

#### 7. Write a Pandas program to select the rows where the score is missing, i.e. is NaN.
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [21]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
dataframe = pd.DataFrame(exam_data, index = labels)
print("Rows where the score is missing:")
dataframe[dataframe['score'].isnull()]

Rows where the score is missing:

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

#### 8. Write a Pandas program to select the rows the score is between 15 and 20 (inclusive).
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [22]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
dataframe = pd.DataFrame(exam_data, index = labels)
print("Rows where the score between 15 and 20 (inclusive):  ")
dataframe[dataframe['score'].between(15,20)]

Rows where the score between 15 and 20 (inclusive):

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

#### 9. Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [23]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
dataframe = pd.DataFrame(exam_data, index = labels)
print("Number of attempts in the examination less than 2 and score greater than 15 :")
dataframe[(dataframe['attempts']<2)&(dataframe['score']>15)]

Number of attempts in the examination less than 2 and score greater than 15 :

    name  score  attempts qualify
j  Jonas   19.0         1     yes

#### 10. Write a Pandas program to change the score in row 'd' to 11.5.
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [25]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
dataframe = pd.DataFrame(exam_data, index = labels)
print("Change the score in row 'd' to 11.5: ")
dataframe.loc['d','score'] = 11.5
dataframe

Change the score in row 'd' to 11.5:

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

#### 11. Write a Pandas program to calculate the sum of the examination attempts by the students.
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [28]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
dataframe = pd.DataFrame(exam_data, index = labels)
print("Sum of the examination attempts by the students:")
dataframe['attempts'].sum()

Sum of the examination attempts by the students:

np.int64(19)

#### 12. Write a Pandas program to calculate the mean of all students' scores. Data is stored in a dataframe.
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [29]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
dataframe = pd.DataFrame(exam_data, index = labels)
print("Mean score for each different student in data frame:")
dataframe['score'].mean()

Mean score for each different student in data frame:

np.float64(13.5625)

#### 13. Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False.
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [30]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
dataframe = pd.DataFrame(exam_data, index = labels)
print("Replace the 'qualify' column contains the values 'yes' and 'no'  with True and  False: ")
dataframe['qualify'] = dataframe['qualify'].map({'yes' : True,'no' : False })
dataframe

Replace the 'qualify' column contains the values 'yes' and 'no'  with True and  False:

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

#### 14. Write a Pandas program to change the name 'James' to 'Suresh' in name column of the DataFrame.
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [32]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
dataframe = pd.DataFrame(exam_data, index = labels)
print("Change the name from 'James' to 'Suresh':  ")
dataframe['name'] = dataframe['name'].replace('James', 'Suresh')
dataframe

Change the name from 'James' to 'Suresh':

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d     Suresh    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

#### 15. Write a Pandas program to delete the 'attempts' column from the DataFrame.
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [33]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
dataframe = pd.DataFrame(exam_data, index = labels)
print("Delete the 'attempts' column from the data frame: ")
dataframe.pop('attempts')
dataframe

Delete the 'attempts' column from the data frame:

        name  score qualify
a  Anastasia   12.5     yes
b       Dima    9.0      no
c  Katherine   16.5     yes
d      James    NaN      no
e      Emily    9.0      no
f    Michael   20.0     yes
g    Matthew   14.5     yes
h      Laura    NaN      no
i      Kevin    8.0      no
j      Jonas   19.0     yes

#### 16. Write a Pandas program to insert a new column in existing DataFrame.
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [35]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
dataframe = pd.DataFrame(exam_data, index = labels)
color = ['Red', 'Blue','Black','Orange','Green','Red','Blue','Black','Green','Red']
print("New DataFrame after inserting the 'color' column :")
dataframe['color'] = color
dataframe

New DataFrame after inserting the 'color' column :

        name  score  attempts qualify   color
a  Anastasia   12.5         1     yes     Red
b       Dima    9.0         3      no    Blue
c  Katherine   16.5         2     yes   Black
d      James    NaN         3      no  Orange
e      Emily    9.0         2      no   Green
f    Michael   20.0         3     yes     Red
g    Matthew   14.5         1     yes    Blue
h      Laura    NaN         1      no   Black
i      Kevin    8.0         2      no   Green
j      Jonas   19.0         1     yes     Red

#### 17. Write a Pandas program to rename columns of a given DataFrame

In [36]:
import pandas as pd
od = {'col1' : [1,2,3],
             'col2' : [4,5,6],
             'col3' : [7,8,9]}
labels = [0,1,2]
dataframe = pd.DataFrame(od, index = labels)
print("New DataFrame after renaming columns: ")
dataframe.rename(columns = {'col1' : 'Column1', 'col2' : 'Column2', 'col3' : 'Column3'}, inplace = True)
dataframe

New DataFrame after renaming columns:

   Column1  Column2  Column3
0        1        4        7
1        2        5        8
2        3        6        9

#### 18. Write a Pandas program to select rows from a given DataFrame based on values in some columns.

In [37]:
import pandas as pd
import numpy as np
od = {'col1' : [1,4,3,4,5],'col2' : [4,5,6,7,8], 'col3' : [7,8,9,0,1]}
labels = [0,1,2,3,4]
dataframe = pd.DataFrame(data = od , index = labels)
print("Rows for colum1 value == 4 : ")
data = dataframe.loc[dataframe['col1'] == 4]
data

Rows for colum1 value == 4 :

   col1  col2  col3
1     4     5     8
3     4     7     0

#### 19. Write a Pandas program to add one row in an existing DataFrame.

In [44]:
import pandas as pd
import numpy as np
od = {'col1' : [1,4,3,4,5],'col2' : [4,5,6,7,8], 'col3' : [7,8,9,0,1]}
labels = [0,1,2,3,4]
dataframe = pd.DataFrame(data = od , index = labels)
print("After adding one row: ")
new_row = {'col1': 10, 'col2' : 11, 'col3' : 12}
dataframe= pd.concat([dataframe,pd.DataFrame([new_row])], ignore_index= True)
data

After adding one row:

   col1  col2  col3
1     4     5     8
3     4     7     0

#### 20. Write a Pandas program to replace all the NaN values with Zero's in a column of a dataframe.

In [45]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
dataframe = pd.DataFrame(exam_data, index = labels)
print("New DataFrame replacing all NaN with 0: ")
data = dataframe.fillna(0)
data

New DataFrame replacing all NaN with 0:

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    0.0         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    0.0         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

#### 21. Write a Pandas program to count the NaN values in one or more columns in DataFrame.

In [46]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
dataframe = pd.DataFrame(exam_data, index = labels)
print("Number of NaN values in one or more columns: ")
data = dataframe.isnull().values.sum()
data

Number of NaN values in one or more columns:

np.int64(2)

#### 22. Write a Pandas program to drop a list of rows from a specified DataFrame.

Sample data:
Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1


New DataFrame after removing 2nd & 4th rows:
   col1  col2  col3
0     1     4     7
1     4     5     8
3     4     7     0

In [47]:
import pandas as pd
import numpy as np
od = {'col1' : [1,4,3,4,5],'col2' : [4,5,6,7,8], 'col3' : [7,8,9,0,1]}
labels = [0,1,2,3,4]
dataframe = pd.DataFrame(data = od , index = labels)
print("New DataFrame after removing 2nd & 4th rows: ")
data = dataframe.drop([2,4])
data

New DataFrame after removing 2nd & 4th rows:

   col1  col2  col3
0     1     4     7
1     4     5     8
3     4     7     0

#### 23. Write a Pandas program to convert DataFrame column type from string to datetime.

Sample data:
String Date:
0    3/11/2000
1    3/12/2000
2    3/13/2000
dtype: object


Original DataFrame (string to datetime):
0 2000-03-11
1 2000-03-12
2 2000-03-13

In [51]:
import pandas as pd
data = pd.Series(['3/11/2000', '3/12/2000', '3/13/2000'])
df = pd.DataFrame(data, columns=['Date'])
df['Date'] = pd.to_datetime(df['Date'])
print(df)

        Date
0 2000-03-11
1 2000-03-12
2 2000-03-13

#### 24. Write a Pandas program to find the row for where the value of a given column is maximum.

ample Output:
Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11
Row where col1 has maximum value:
4
Row where col2 has maximum value:
3
Row where col3 has maximum value:
2

In [52]:
import pandas as pd
Data = {'col1' : [1, 2, 3, 4, 7], 'col2' : [4, 5, 6, 9, 5], 'col3' : [7, 8, 12, 1, 11]}
dataframe = pd.DataFrame(data = Data)
print("Original DataFrame : ")
print(dataframe)
print("Row where col1 has maximum value:")
print(dataframe['col1'].idxmax())
print("Row where col2 has maximum value:")
print(dataframe['col2'].idxmax())
print("Row where col3 has maximum value:")
print(dataframe['col3'].idxmax())

Original DataFrame :
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11
Row where col1 has maximum value:
4
Row where col2 has maximum value:
3
Row where col3 has maximum value:
2

#### 25. Write a Pandas program to get the datatypes of columns of a DataFrame.

Sample data:
Original DataFrame:
   attempts       name qualify  score
0         1  Anastasia     yes   12.5
1         3       Dima      no    9.0
.......
8         2      Kevin      no    8.0
9         1      Jonas     yes   19.0
Data types of the columns of the said DataFrame:
attempts      int64
name         object
qualify      object
score       float64
dtype: object

In [53]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
dataframe = pd.DataFrame(exam_data, index = labels)
print("Data types of the columns of the said DataFrame:")
dataframe.name.dtype
dataframe.score.dtype
dataframe.attempts.dtype
dataframe.qualify.dtype
dataframe.dtypes

Data types of the columns of the said DataFrame:

name         object
score       float64
attempts      int64
qualify      object
dtype: object

#### 26. Write a Pandas program to group by the first column and get second column as lists in rows.

Sample data:
Original DataFrame
col1 col2
0 C1 1
1 C1 2
2 C2 3
3 C2 3
4 C2 4
5 C3 6
6 C2 5


Group on the col1:
col1
C1 [1, 2]
C2 [3, 3, 4, 5]
C3 [6]
Name: col2, dtype: object

In [54]:
import pandas as pd
dataframe = pd.DataFrame({'col1': ['C1','C1','C2','C2','C2','C3','C2'], 'col2' : [1,2,3,3,4,6,5]})
print("Group on the col1:")
dataframe.groupby('col1')['col2'].apply(list)

Group on the col1:

col1
C1          [1, 2]
C2    [3, 3, 4, 5]
C3             [6]
Name: col2, dtype: object

#### 27 Write a Pandas program to count number of columns of a DataFrame.

Sample Output:
Original DataFrame
  col1 col2 col3
0  1    4   7
1  2    5   8
2  3    6   12
3  4    9   1
4  7    5   11

Number of columns:
3

In [55]:
import pandas as pd
Data = {'col1' : [1, 2, 3, 4, 7], 'col2' : [4, 5, 6, 9, 5], 'col3' : [7, 8, 12, 1, 11]}
dataframe = pd.DataFrame(data = Data)
print("Original dataframe")
print(dataframe)
col = dataframe.columns
print("Number of columns :")
len(col)

Original dataframe
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11
Number of columns :

3

#### 28. Write a Pandas program to get first n records of a DataFrame.

Sample Output:
Original DataFrame
col1 col2 col3
0 1 4 7
1 2 5 5
2 3 6 8
3 4 9 12
4 7 5 1
5 11 0 11

First 3 rows of the said DataFrame':
col1 col2 col3
0 1 4 7
1 2 5 5
2 3 6 8

In [56]:
import pandas as pd
Data = {'col1' : [1, 2, 3, 4, 7, 11], 'col2' : [4, 5, 6, 9, 5, 0], 'col3' : [7, 5, 8, 12, 1, 11,]}
dataframe = pd.DataFrame(data = Data)
print("Original dataframe")
print(dataframe)
print("First 3 rows of the said DataFrame:")
dataframe.head(3)

Original dataframe
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11
First 3 rows of the said DataFrame:

   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8

#### 29. Write a Pandas program to get last n records of a DataFrame.

Sample Output:
Original DataFrame
col1 col2 col3
0 1 4 7
1 2 5 5
2 3 6 8
3 4 9 12
4 7 5 1
5 11 0 11

Last 3 rows of the said DataFrame':
col1 col2 col3
3 4 9 12
4 7 5 1
5 11 0 11

In [57]:
import pandas as pd
Data = {'col1' : [1, 2, 3, 4, 7, 11], 'col2' : [4, 5, 6, 9, 5, 0], 'col3' : [7, 5, 8, 12, 1, 11,]}
dataframe = pd.DataFrame(data = Data)
print("Original dataframe")
print(dataframe)
print("Last 3 rows of the said DataFrame:")
dataframe.tail(3)

Original dataframe
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11
Last 3 rows of the said DataFrame:

   col1  col2  col3
3     4     9    12
4     7     5     1
5    11     0    11

#### 30. Write a Pandas program to get topmost n records within each group of a DataFrame.

Sample Output:
Original DataFrame
col1 col2 col3
0 1 4 7
1 2 5 5
2 3 6 8
3 4 9 12
4 7 5 1
5 11 0 11

topmost n records within each group of a DataFrame:
col1 col2 col3
5 11 0 11
4 7 5 1
3 4 9 12
col1 col2 col3
3 4 9 12
2 3 6 8
1 2 5 5
4 7 5 1
col1 col2 col3
3 4 9 12
5 11 0 11
2 3 6 8

In [58]:
import pandas as pd
Data = {'col1' : [1, 2, 3, 4, 7, 11], 'col2' : [4, 5, 6, 9, 5, 0], 'col3' : [7, 5, 8, 12, 1, 11,]}
dataframe = pd.DataFrame(data = Data)
print("Original dataframe")
print(dataframe)
print("Topmost n records within each group of a DataFrame:")
dataframe1 = dataframe.nlargest(3,'col1')
print(dataframe1)
dataframe2 = dataframe.nlargest(3,'col2')
print(dataframe2)
dataframe3 = dataframe.nlargest(3,'col3')
print(dataframe3)

Original dataframe
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11
Topmost n records within each group of a DataFrame:
   col1  col2  col3
5    11     0    11
4     7     5     1
3     4     9    12
   col1  col2  col3
3     4     9    12
2     3     6     8
1     2     5     5
   col1  col2  col3
3     4     9    12
5    11     0    11
2     3     6     8

#### 31. Write a Pandas program to add a prefix or suffix to all columns of a given DataFrame.

Sample Output:
Original DataFrame
W X Y Z
0 68 78 84 86
1 75 85 94 97
2 86 96 89 96
3 80 80 83 72
4 66 86 86 83

Add prefix:
A_W A_X A_Y A_Z
0 68 78 84 86
1 75 85 94 97
2 86 96 89 96
3 80 80 83 72
4 66 86 86 83

Add suffix:
W_1 X_1 Y_1 Z_1
0 68 78 84 86
1 75 85 94 97
2 86 96 89 96
3 80 80 83 72
4 66 86 86 83

In [59]:
import pandas as pd
Data = {'W': [68,75,86,80,66], 'X': [78,85,96,80,86], 'Y': [84,94,89,83,86], 'Z': [86,97,96,72,83]}
dataframe = pd.DataFrame(Data)
print("Original DataFrame:")
print(dataframe)
print("Add prefix:")
dataframe1 = dataframe.add_prefix("A_")
print(dataframe1)
print("Add suffix:")
dataframe2 = dataframe.add_suffix("_1")
print(dataframe2)

Original DataFrame:
    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
2  86  96  89  96
3  80  80  83  72
4  66  86  86  83
Add prefix:
   A_W  A_X  A_Y  A_Z
0   68   78   84   86
1   75   85   94   97
2   86   96   89   96
3   80   80   83   72
4   66   86   86   83
Add suffix:
   W_1  X_1  Y_1  Z_1
0   68   78   84   86
1   75   85   94   97
2   86   96   89   96
3   80   80   83   72
4   66   86   86   83

#### 32. Write a Pandas program to convert continuous values of a column in a given DataFrame to categorical.

Input:
{ 'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
'Age': [18, 22, 40, 50, 80, 5] }


Output:
Age group:
0 kids
1 adult
2 elderly
3 adult
4 elderly
5 kids
Name: age_groups, dtype: category
Categories (3, object): [kids < adult < elderly]

In [60]:
import pandas as pd
dataframe = pd.DataFrame({ 'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton', 'Kierra gentry'],'Age': [18, 22, 40, 50, 80, 5] })
print("Age group : ")
dataframe["age_groups"] = pd.cut(dataframe["Age"], bins = [0,17,39,99], labels = ["Kids","Adult","Elderly"])
dataframe["age_groups"]

Age group :

0      Adult
1      Adult
2    Elderly
3    Elderly
4    Elderly
5       Kids
Name: age_groups, dtype: category
Categories (3, object): ['Kids' < 'Adult' < 'Elderly']

#### 33. Write a Pandas program to append rows to an existing DataFrame and display the combined data.

Test Data:
tudent_data1
  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199


New Row(s)
student_id                  S6
name          Scarlette Fisher
marks                      205
dtype: object

In [65]:
import pandas as pd

# Existing DataFrame (student_data1)
student_data1 = pd.DataFrame({
    'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
    'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'],
    'marks': [200, 210, 190, 222, 199]
})

# New row(s) to append
new_row = pd.DataFrame({
    'student_id': ['S6'],
    'name': ['Scarlette Fisher'],
    'marks': [205]
})

# Concatenate the DataFrames
student_data1 = pd.concat([student_data1, new_row], ignore_index=True)

# Display the combined DataFrame
print(student_data1)

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
5         S6  Scarlette Fisher    205

#### 34 Write a Pandas program to join the two given dataframes along rows and merge with another dataframe along the common column id.

Test Data:
student_data1:
  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
student_data2:
  student_id              name  marks
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

exam_data:
   student_id  exam_id
0          S1       23
1          S2       45
2          S3       12
3          S4       67
4          S5       21
5          S7       55
6          S8       33
7          S9       14
8         S10       56
9         S11       83
10        S12       88
11        S13       12

In [66]:
import pandas as pd
Student_data1 = pd.DataFrame({'Name': ['Danniella Fenton' ,'Ryder Storey' ,'Bryce Jensen' ,'Ed Bernal' , 'Kwame Morin'] ,
              'Student_id' : ['S1','S2','S3','S4','S5'],
              'Marks' : [200,210,190,222,199]})
Student_data2 = pd.DataFrame({
        'Name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'],
        'Student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'Marks': [201, 200, 198, 219, 201]})
Exam_data = pd.DataFrame({'Student_id': ['S1', 'S2', 'S3', 'S4', 'S5', 'S7', 'S8', 'S9', 'S10', 'S11', 'S12', 'S13'],
        'Exam_id': [23, 45, 12, 67, 21, 55, 33, 14, 56, 83, 88, 12]})
print("Test data : ")
print("Student_data1:")
print(Student_data1)
print("Student_data2:")
print(Student_data2)
print("Exam_data: ")
print(Exam_data)
print("Two dataframes join along rows :")
Result = pd.concat([Student_data1 ,Student_data2 ])
print(Result)
print("Join result and exam data along student id :")
Final_data = pd.merge(Result, Exam_data, on='Student_id')
Final_data

Test data :
Student_data1:
               Name Student_id  Marks
0  Danniella Fenton         S1    200
1      Ryder Storey         S2    210
2      Bryce Jensen         S3    190
3         Ed Bernal         S4    222
4       Kwame Morin         S5    199
Student_data2:
               Name Student_id  Marks
0  Scarlette Fisher         S4    201
1  Carla Williamson         S5    200
2       Dante Morse         S6    198
3    Kaiser William         S7    219
4   Madeeha Preston         S8    201
Exam_data:
   Student_id  Exam_id
0          S1       23
1          S2       45
2          S3       12
3          S4       67
4          S5       21
5          S7       55
6          S8       33
7          S9       14
8         S10       56
9         S11       83
10        S12       88
11        S13       12
Two dataframes join along rows :
               Name Student_id  Marks
0  Danniella Fenton         S1    200
1      Ryder Storey         S2    210
2      Bryce Jensen         S3    190
3         Ed Bernal         S4    222
4       Kwame Morin         S5    199
0  Scarlette Fisher         S4    201
1  Carla Williamson         S5    200
2       Dante Morse         S6    198
3    Kaiser William         S7    219
4   Madeeha Preston         S8    201
Join result and exam data along student id :

               Name Student_id  Marks  Exam_id
0  Danniella Fenton         S1    200       23
1      Ryder Storey         S2    210       45
2      Bryce Jensen         S3    190       12
3         Ed Bernal         S4    222       67
4       Kwame Morin         S5    199       21
5  Scarlette Fisher         S4    201       67
6  Carla Williamson         S5    200       21
7    Kaiser William         S7    219       55
8   Madeeha Preston         S8    201       33